ezois_ka/oooezoiskaobmen.vssoft_ka_ooo_ezois/src/Documents/ВнутреннееПотребление/ВнутреннееПотребление.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="b726b4a4-d691-4fa0-bef7-e6f1bd056cbf">
  <name>ВнутреннееПотребление</name>
  <objectBelonging>Adopted</objectBelonging>
  <registerRecords>AccumulationRegister.vs_Доизготовление</registerRecords>
  <registerRecords>AccumulationRegister.ИТБК_Доизготовление</registerRecords>
  <attributes>
    <name>vs_СтатьяРасходов</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.СтатьиРасходов</types>
      <types>ChartOfCharacteristicTypesRef.СтатьиАктивовПассивов</types>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="8f13106d-31d1-441b-8330-ef025f55fdbf">
    <name>ЗаказНаВнутреннееПотребление</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="7bab1076-c626-4662-b814-ed3a1973efb8">
    <name>СторнируемыйДокумент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="e12d08bd-1d79-40a7-b21c-f669b1a7094b">
    <name>ДокументОснование</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="930f6e33-ad27-42aa-847a-055d575b4e7a">
    <name>ИТБК_АктИзготовления</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>vs_АктИзготовления</name>
    <type>
      <types>DocumentRef.ЗаказНаСборку</types>
      <types>DocumentRef.СборкаТоваров</types>
    </type>
  </attributes>
  <attributes>
    <name>vs_ЭтоДоизготовление</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>vs_Статус</name>
    <type>
      <types>EnumRef.СтатусыСборокТоваров</types>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="6ac93f4f-ec62-46e7-b4ca-38e795bf02db">
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="4e50af2f-d7e6-4349-bd07-de9f379b59ea">
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="9bf2417c-ed59-4c71-a254-2f2338f41425">
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="22ea815e-ceda-4730-8b5e-62907ac780b9">
    <name>ХозяйственнаяОперация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="385ab3ce-dd41-4c25-b89b-974bb478f380">
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="0da3af76-0f90-43fc-bf8d-6d86f1169900">
      <name>АналитикаРасходов</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="a7dbbbcd-b6fb-4d47-96b7-edcd8cf2d437">
      <name>Назначение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="3dc4c4e8-1141-4c3c-95fd-9a8722f0d2d8">
      <name>ЗаказНаВнутреннееПотребление</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>vs_Доизготовление</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатьяРасходов</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.СтатьиРасходов</types>
        <types>ChartOfCharacteristicTypesRef.СтатьиАктивовПассивов</types>
      </type>
    </attributes>
    <attributes>
      <name>ТребуетсяДоизготовить</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Отказ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АналитикаРасходов</name>
      <type>
        <types>Characteristic.СтатьиРасходов</types>
      </type>
    </attributes>
    <attributes>
      <name>Назначение</name>
      <type>
        <types>CatalogRef.Назначения</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ezois_ka/oooezoiskaobmen.vssoft_ka_ooo_ezois/src/AccumulationRegisters/vs_Доизготовление/vs_Доизготовление.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>vs_Доизготовление</name>
  <resources>
    <name>Доизготовить</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>АктИзготовления</name>
    <type>
      <types>DocumentRef.ЗаказНаСборку</types>
      <types>DocumentRef.СборкаТоваров</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

ezois_ka/oooezoiskaobmen.vssoft_ka_ooo_ezois/src/Enums/ХозяйственныеОперации/ХозяйственныеОперации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="351b0c5b-74c3-4aaa-a93b-7246b941f797">
  <name>ХозяйственныеОперации</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="1e18177a-fe02-4999-a369-fb008fe9fd42">
    <name>ПеречислениеВБюджет</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="692215c8-f484-4e22-b24f-430cd2009fae">
    <name>ОплатаДенежныхСредствВДругуюОрганизацию</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="95818758-8542-4405-8773-6b644d757e22">
    <name>ВыдачаДенежныхСредствПодотчетнику</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="1879ad4f-47e1-438b-9738-f1429bc3c780">
    <name>ПеречислениеТаможне</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="da785c97-98fb-4ee6-8990-f175fe8496ef">
    <name>КонвертацияВалюты</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="b5771beb-5568-450d-963a-bfe9090b7f8c">
    <name>ВыдачаЗаймов</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="1923f574-7981-46df-b96d-b293c2f88d8c">
    <name>ОплатаПоставщику</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="a07305c5-0d5c-4195-8220-2eb29fa05ef5">
    <name>ВнутренняяПередачаДенежныхСредств</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="d0e70b4c-e687-4b56-a586-c641aa8d81ae">
    <name>ВыплатаЗарплаты</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="2d869152-e27f-4d56-a690-de6ac662ace2">
    <name>ОплатаПоКредитам</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="572c15b7-b781-43a9-91fb-eecc7ecffee8">
    <name>ПеречислениеНаДепозиты</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="6915db6f-cc8d-4766-aca9-84cf48edcd58">
    <name>ВыдачаЗаймаСотруднику</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="693adf02-fccb-4cd9-a092-f9fa532b7983">
    <name>ПрочаяВыдачаДенежныхСредств</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="724dc975-c8d5-4eea-b4af-52c1b39555e5">
    <name>ВозвратОплатыКлиенту</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="51ad2381-0d1f-4a17-823e-32dfa2be2232">
    <name>ВозвратДенежныхСредствВДругуюОрганизацию</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="b4199927-65e9-4e54-90f9-456e4c68a93f">
    <name>ВыплатаЗарплатыПоЗарплатномуПроекту</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="6d079ef6-b405-487d-9ff8-d6cbe795713f">
    <name>ВыплатаЗарплатыНаЛицевыеСчета</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="240b34c3-b18a-47c5-9f2f-bd241e23e42a">
    <name>ВыплатаЗарплатыЧерезКассу</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="aee89418-2c06-47ad-bf28-064f762e59aa">
    <name>ВозвратОплатыНаПлатежнуюКарту</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="15ce947b-5b8c-4087-b372-2f3f60dedd76">
    <name>ОплатаАрендодателю</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="82e6dbf8-d7ba-4382-9880-9e83d175a158">
    <name>СписаниеТоваровПоТребованию</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="f675a52b-940a-480e-8374-c64ff49e4478">
    <name>СборкаТоваров</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="ad2322ce-9ed5-4e79-ace7-6f03b97d9445">
    <name>РазборкаТоваров</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

ezois_ka/oooezoiskaobmen.vssoft_ka_ooo_ezois/src/Enums/СтатусыСборокТоваров/СтатусыСборокТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="d32e7159-13c4-4ac8-9058-9848ec019475">
  <name>СтатусыСборокТоваров</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="c5d672fd-488c-4858-89d0-05a9afcde29b">
    <name>ВРаботе</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="73cc6264-ff74-4ff1-a2a7-0fd6e2fc6e85">
    <name>СобраноРазобрано</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

ezois_ka/oooezoiskaobmen.vssoft_ka_ooo_ezois/src/Documents/ВнутреннееПотребление/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

//&После("ПередЗаписью")
//Процедура vs_ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
//	Если ЗначениеЗаполнено(vs_СтатьяРасходов) Тогда
//		Массив = Товары.ВыгрузитьКолонку("СтатьяРасходов");
//		НаибольшийИндекс = Массив.ВГраница();
//		Если Не НаибольшийИндекс < 0 Тогда
//			Для Эл = 0 По НаибольшийИндекс Цикл
//				Массив.Установить(Эл, vs_СтатьяРасходов);	
//			КонецЦикла;
//			Товары.ЗагрузитьКолонку(Массив, "СтатьяРасходов");
//		КонецЕсли;
//	КонецЕсли;
//КонецПроцедуры

&После("ОбработкаПроверкиЗаполнения")
Процедура vs_ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	МассивНепроверяемыхРеквизитов = Новый Массив;
	Если ЭтотОбъект.vs_ЭтоДоизготовление тогда
		МассивНепроверяемыхРеквизитов.Добавить("vs_СтатьяРасходов");
		МассивНепроверяемыхРеквизитов.Добавить("Товары");
		
		ПроверяемыеРеквизиты.Добавить("vs_Статус"); 
		ПроверяемыеРеквизиты.Добавить("vs_АктИзготовления");
		
		Ошибки = Неопределено;
		Для Каждого Стр из vs_Доизготовление Цикл
			Если Стр.Отказ > Стр.Количество 
				и Стр.Отказ - Стр.Количество > Стр.ТребуетсяДоизготовить Тогда
				ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки, ЭтотОбъект, СтрШаблон("Отказ > Доизготовить и остаток к доизготовлению! Номенлатура %1", Стр.Номенклатура),,Стр.НомерСтроки); 
			ИначеЕсли (Стр.Отказ < Стр.Количество 
				или Стр.Отказ - Стр.Количество < Стр.ТребуетсяДоизготовить)
				и Справочники.ВидыНоменклатуры.НастройкиИспользованияСерий(Стр.Номенклатура.ВидНоменклатуры).ИспользоватьСерии и не значениеЗаполнено(Стр.Серия) Тогда
				ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки, ЭтотОбъект, СтрШаблон("Не заполнена серия! Номенлатура %1", Стр.Номенклатура),,Стр.НомерСтроки); 
			КонецЕсли;
		КонецЦикла;
		Если Не Ошибки = Неопределено Тогда
			Модифицированность = истина;
			ОбщегоНазначенияКлиентСервер.СообщитьОшибкиПользователю(Ошибки, Отказ);
			//Сообщить(Отказ);
		КонецЕсли;
	ИначеЕсли 	ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.СписаниеТоваровПоТребованию 
			или ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПередачаВЭксплуатацию Тогда
		Если ЗначениеЗаполнено(vs_СтатьяРасходов) Тогда
			Массив = Товары.ВыгрузитьКолонку("СтатьяРасходов");
			НаибольшийИндекс = Массив.ВГраница();
			Если Не НаибольшийИндекс < 0 Тогда
				Для Эл = 0 По НаибольшийИндекс Цикл
					Массив.Установить(Эл, vs_СтатьяРасходов);	
				КонецЦикла;
				Товары.ЗагрузитьКолонку(Массив, "СтатьяРасходов");
			КонецЕсли;
		КонецЕсли;
	Иначе
		МассивНепроверяемыхРеквизитов.Добавить("vs_СтатьяРасходов");
	КонецЕсли;
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);
КонецПроцедуры


&Перед("ПередЗаписью")
Процедура vs_ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если vs_ЭтоДоизготовление 
		и РежимЗаписи = РежимЗаписиДокумента.Проведение 
		и Не vs_Статус = Перечисления.СтатусыСборокТоваров.СобраноРазобрано Тогда
		Ошибки = Неопределено;
		ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки, "vs_Статус", "Проведение доизготовлления возможно только в статусе ""Выполнено""");
		ОбщегоНазначенияКлиентСервер.СообщитьОшибкиПользователю(Ошибки, Отказ);
		Возврат;		
	КонецЕсли;
	
	//Если ЭтотОбъект.vs_ЭтоДоизготовление тогда
	//	Товары.Очистить();
	//	Серии.Очистить();
	//	ИТБК_ЭтоДоизготовление	 = vs_ЭтоДоизготовление;
	//	ИТБК_АктИзготовления	 = vs_АктИзготовления;
	//	ИТБК_СтатьяРасходов		 = vs_СтатьяРасходов;
	//	ИТБК_Статус				 = vs_Статус;
	//	ИТБК_Доизготовление.Загрузить(vs_Доизготовление.Выгрузить());
	//	для Каждого стр из vs_Доизготовление Цикл
	//		
	//		Если стр.Количество > 0  тогда
	//			
	//			Если стр.Номенклатура.видноменклатуры.ИспользоватьСерии и стр.Серия.Пустая() тогда
	//				//ОбщегоНазначения.СообщитьПользователю("Не заполнена серия " + стр.Номенклатура,ЭтотОбъект,"","",Отказ); // begin fix Designer09.09.2021 4:04:42
	//				ОбщегоНазначения.СообщитьПользователю(СтрШаблон("Не заполнена серия %1", стр.Номенклатура), ЭтотОбъект,"","",Отказ);// end fix Designer09.09.2021 4:04:53
	//			КонецЕсли;
	//			
	//			стрТовары = Товары.Добавить();
	//			стрТовары.Номенклатура = стр.Номенклатура;
	//			стрТовары.Характеристика = стр.Характеристика;     						// fix Designer 14.02.2023 16:45:13
	//			стрТовары.КоличествоУпаковок = стр.Количество;
	//			стрТовары.Количество = стр.Количество;
	//			стрТовары.СтатьяРасходов = стр.СтатьяРасходов;
	//			стрТовары.АналитикаРасходов = стр.АналитикаРасходов;
	//			стрТовары.Назначение = стр.Назначение;     								// fix Designer 14.02.2023 16:45:13
	//			
	//			Если ЗначениеЗаполнено(стр.Серия) тогда
	//				стрТовары.СтатусУказанияСерий  				= 4;
	//				стрТовары.СтатусУказанияСерийОтправитель 	= 4; 					// fix Designer 14.02.2023 16:45:13
	//				НовСтр                      				= ЭтотОбъект.Серии.Добавить();
	//				НовСтр.Номенклатура        					= стр.Номенклатура;
	//				НовСтр.Характеристика 						= стр.Характеристика;  	// fix Designer 14.02.2023 16:45:13
	//				НовСтр.Серия                				= стр.Серия;
	//				НовСтр.Назначение 							= стр.Назначение;     	// fix Designer 14.02.2023 16:45:13
	//				НовСтр.Количество           				= стр.Количество;
	//			КонецЕсли;
	//		КонецЕсли;
	//	КонецЦикла;
	//КонецЕсли;
	
КонецПроцедуры

&После("ОбработкаПроведения")
Процедура vs_ОбработкаПроведения(Отказ, РежимПроведения)
	Если Не vs_ЭтоДоизготовление Тогда 
		Возврат;
	ИначеЕсли Не  Движения.vs_Доизготовление.Количество() ТОгда
		Ошибки = Неопределено;
		ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки, ЭтотОбъект, СтрШаблон("Не заполнена ТЧ доизготовления %1",ЭтотОбъект));
		ОбщегоНазначенияКлиентСервер.СообщитьОшибкиПользователю(Ошибки, Отказ);
		Возврат;
	КонецЕсли; // fix Designer09.09.2021 4:00:58
	
	Возврат;
	//для Каждого Движение из Движения цикл
	//	Движение.Очистить();
	//КонецЦикла;
	//// begin Suetin 2021/09/05
	////для Каждого  стр из ИТБК_Доизготовление цикл
	////	Если  стр.Количество > 0 тогда
	////		стрДвижения = набор.добавитьРасход();
	////		стрДвижения.Период = Дата;
	////		стрДвижения.АктИзготовления = ИТБК_АктИзготовления;
	////		стрДвижения.Номенклатура = стр.Номенклатура;
	////		стрДвижения.Доизготовить = стр.Количество;
	////	КонецЕсли;
	////	Если  стр.Отказ > 0 тогда
	////		стрДвижения = набор.добавитьПриход();
	////		стрДвижения.Период = Дата;
	////		стрДвижения.АктИзготовления = ИТБК_АктИзготовления;
	////		стрДвижения.Номенклатура = стр.Номенклатура;
	////		стрДвижения.Доизготовить = - стр.Отказ;
	////	КонецЕсли;
	////КонецЦикла;
	//ТекстЗапроса = 
	//"ВЫБРАТЬ
	//|	&vs_АктИзготовления КАК АктИзготовления,
	//|	ДДоизготовление.Номенклатура КАК Номенклатура,
	//|	ДДоизготовление.ТребуетсяДоизготовить КАК ТребуетсяДоизготовить,
	//|	ДДоизготовление.Количество КАК Количество,
	//|	ДДоизготовление.Отказ КАК Отказ
	//|ПОМЕСТИТЬ ДДокумента
	//|ИЗ
	//|	&ДДоизготовление КАК ДДоизготовление
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	ДДокумента.АктИзготовления КАК АктИзготовления,
	//|	ДДокумента.Номенклатура КАК Номенклатура,
	//|	СУММА(ВЫБОР
	//|			КОГДА ЕСТЬNULL(vs_Доизготовление.ДоизготовитьОстаток, 0) > 0
	//|				ТОГДА ЕСТЬNULL(vs_Доизготовление.ДоизготовитьОстаток, 0)
	//|			ИНАЧЕ 0
	//|		КОНЕЦ) КАК ДоизготовитьОстаток,
	//|	СУММА(ДДокумента.ТребуетсяДоизготовить) КАК ТребуетсяДоизготовить,
	//|	СУММА(ДДокумента.Количество) КАК Количество,
	//|	СУММА(ДДокумента.Отказ) КАК Отказ
	//|ИЗ
	//|	ДДокумента КАК ДДокумента
	//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.vs_Доизготовление.Остатки(
	//|				&ДатаКон,
	//|				(АктИзготовления, Номенклатура) В
	//|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
	//|						Т.АктИзготовления,
	//|						Т.Номенклатура
	//|					ИЗ
	//|						ДДокумента КАК Т)) КАК vs_Доизготовление
	//|		ПО ДДокумента.АктИзготовления = vs_Доизготовление.АктИзготовления
	//|			И ДДокумента.Номенклатура = vs_Доизготовление.Номенклатура
	//|
	//|СГРУППИРОВАТЬ ПО                                          
	//
	//|	ДДокумента.АктИзготовления,
	//|	ДДокумента.Номенклатура";
	//Запрос = Новый Запрос(ТекстЗапроса);
	//Запрос.УстановитьПараметр("ДатаКон"				, Новый Граница(Новый МоментВремени(Дата, Ссылка), ВидГраницы.Исключая));
	////Запрос.УстановитьПараметр("ДДоизготовление"	, ИТБК_Доизготовление.Выгрузить());
	//Т = vs_Доизготовление.Выгрузить();
	////Т.Свернуть("Номенклатура,ТребуетсяДоизготовить,Отказ","Количество");
	//Т.Свернуть("Номенклатура","Количество,ТребуетсяДоизготовить,Отказ");
	//Запрос.УстановитьПараметр("ДДоизготовление"		,Т);  // fix Suetin 4/10/2023 3:50:03 PM
	//Запрос.УстановитьПараметр("vs_АктИзготовления", vs_АктИзготовления);
	////Результат = Запрос.Выполнить();
	//Р=Запрос.ВыполнитьПакетСПромежуточнымиДанными();
	//Результат=Р[1];
	//Ошибки = Неопределено;
	//Если Результат.Пустой() Тогда
	//	ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки, ЭтотОбъект, СтрШаблон("Остатка нет для доизготовления %1",vs_АктИзготовления));
	//	ОбщегоНазначенияКлиентСервер.СообщитьОшибкиПользователю(Ошибки, Отказ);
	//	Возврат;
	//КонецЕсли;
	//Набор = Движения.vs_Доизготовление; 
	//Набор1 = Движения.ИТБК_Доизготовление;
	//Выборка = Результат.Выбрать();
	//Пока Выборка.Следующий() Цикл
	//	Если Выборка.Отказ>Выборка.ДоизготовитьОстаток Тогда
	//		ОбщегоНазначения.СообщитьПользователю(СтрШаблон("Отказ %1 > Остаток (Доизготовить) %2",Выборка.Отказ,Выборка.ДоизготовитьОстаток));
	//	КонецЕсли;
	//	ВыборкаОтказ = Мин(Выборка.Отказ, Выборка.ДоизготовитьОстаток);
	//	Доизготовить = Мин(Выборка.Количество,Выборка.ДоизготовитьОстаток-ВыборкаОтказ);
	//	Доизготовить = ?(Доизготовить<0,0,Доизготовить);
	//	
	//	Если Не Доизготовить > 0 и Не ВыборкаОтказ > 0 и Не Выборка.Количество > 0 Тогда
	//		Структ = Новый Структура("Номенклатура", Выборка.Номенклатура);
	//		НайденныеСтр = vs_Доизготовление.НайтиСтроки(Структ);
	//		
	//		//ОбщегоНазначения.СообщитьПользователю(НайденныеСтр.Количество());
	//		//ОбщегоНазначения.СообщитьПользователю(НайденныеСтр[0].НомерСтроки);
	//		//ОбщегоНазначения.СообщитьПользователю(НайденныеСтр[0].Номенклатура);
	//		
	//		ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки,
	//			"Объект.vs_Доизготовление[%1].Номенклатура", 
	//			//СтрШаблон("Номенклатура %1 - Доизготовить %2, Отказ %3, Количество %4, Неправильно!", НайденныеСтр[0].Номенклатура, Доизготовить, ВыборкаОтказ, Выборка.Количество),
	//			СтрШаблон("Номенклатура %1 - Доизготовить %2, Отказ %3, Количество %4, Неправильно!", НайденныеСтр[0].Номенклатура, Доизготовить, ВыборкаОтказ, Выборка.Количество),
	//			Неопределено,НайденныеСтр[0].НомерСтроки-1);
	//			Продолжить;
	//	КонецЕсли;
	//	
	//	Если Доизготовить > 0 тогда
	//		стрДвижения 				= Набор.ДобавитьРасход();
	//		стрДвижения.Период 			= Дата;
	//		стрДвижения.АктИзготовления = Выборка.АктИзготовления;
	//		стрДвижения.Номенклатура 	= Выборка.Номенклатура;
	//		стрДвижения.Доизготовить 	= Доизготовить; 
	//		
	//		стрДвижения 				= Набор1.ДобавитьРасход();
	//		стрДвижения.Период 			= Дата;
	//		стрДвижения.АктИзготовления = Выборка.АктИзготовления;
	//		стрДвижения.Номенклатура 	= Выборка.Номенклатура;
	//		стрДвижения.Доизготовить 	= Доизготовить;
	//	КонецЕсли;
	//	Если ВыборкаОтказ > 0 тогда
	//		стрДвижения 				= Набор.ДобавитьПриход();
	//		стрДвижения.Период 			= Дата;
	//		стрДвижения.АктИзготовления = Выборка.АктИзготовления;
	//		стрДвижения.Номенклатура 	= Выборка.Номенклатура;
	//		стрДвижения.Доизготовить 	= - ВыборкаОтказ; 
	//		
	//		стрДвижения 				= Набор1.ДобавитьПриход();
	//		стрДвижения.Период 			= Дата;
	//		стрДвижения.АктИзготовления = Выборка.АктИзготовления;
	//		стрДвижения.Номенклатура 	= Выборка.Номенклатура;
	//		стрДвижения.Доизготовить 	= - ВыборкаОтказ;
	//	КонецЕсли;
	//	Если Не Доизготовить > 0 и Не ВыборкаОтказ > 0 и Выборка.Количество > 0 Тогда
	//		стрДвижения 				= Набор.ДобавитьПриход();
	//		стрДвижения.Период 			= Дата;
	//		стрДвижения.АктИзготовления = Выборка.АктИзготовления;
	//		стрДвижения.Номенклатура 	= Выборка.Номенклатура;
	//		стрДвижения.Доизготовить 	= Выборка.Количество;
	//		
	//		стрДвижения 				= Набор.ДобавитьРасход();
	//		стрДвижения.Период 			= Дата;
	//		стрДвижения.АктИзготовления = Выборка.АктИзготовления;
	//		стрДвижения.Номенклатура 	= Выборка.Номенклатура;
	//		стрДвижения.Доизготовить 	= Выборка.Количество; 
	//		
	//		
	//		стрДвижения 				= Набор1.ДобавитьПриход();
	//		стрДвижения.Период 			= Дата;
	//		стрДвижения.АктИзготовления = Выборка.АктИзготовления;
	//		стрДвижения.Номенклатура 	= Выборка.Номенклатура;
	//		стрДвижения.Доизготовить 	= Выборка.Количество;
	//		
	//		стрДвижения 				= Набор1.ДобавитьРасход();
	//		стрДвижения.Период 			= Дата;
	//		стрДвижения.АктИзготовления = Выборка.АктИзготовления;
	//		стрДвижения.Номенклатура 	= Выборка.Номенклатура;
	//		стрДвижения.Доизготовить 	= Выборка.Количество;
	//	КонецЕсли;
	//		
	//КонецЦикла;
	//
	//Если Не Ошибки = Неопределено 
	//	и Ошибки.СписокОшибок.Количество() = Т.Количество() Тогда
	//	ОбщегоНазначенияКлиентСервер.СообщитьОшибкиПользователю(Ошибки, Отказ);
	//	Возврат;
	//КонецЕсли;
	//// end Suetin 2021/09/05
	//Набор.Записывать = Истина;
	//Набор1.Записывать = Истина;
	//Движения.Записать();
	
КонецПроцедуры

//&После("ОбработкаПроверкиЗаполнения")
//Процедура ИТБК_ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
//	
//	
//	МассивНепроверяемыхРеквизитов = новый Массив;
//	Если ЭтотОбъект.ИТБК_ЭтоДоизготовление тогда
//		МассивНепроверяемыхРеквизитов.Добавить("Товары")
//	КонецЕсли;
//	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);
//	
//КонецПроцедуры

#КонецЕсли
